GopalSaraf/Practicals/PSDL/include/proc/pic18f66j16.inc
// Register: PMCON
#define PMCON PMCON
PMCON                                    equ 0F64h

// Register: PMCONL
#define PMCONL PMCONL
PMCONL                                   equ 0F64h
// bitfield definitions
PMCONL_RDSP_POSN                         equ 0000h
PMCONL_RDSP_POSITION                     equ 0000h
PMCONL_RDSP_SIZE                         equ 0001h
PMCONL_RDSP_LENGTH                       equ 0001h
PMCONL_RDSP_MASK                         equ 0001h
PMCONL_WRSP_POSN                         equ 0001h
PMCONL_WRSP_POSITION                     equ 0001h
PMCONL_WRSP_SIZE                         equ 0001h
PMCONL_WRSP_LENGTH                       equ 0001h
PMCONL_WRSP_MASK                         equ 0002h
PMCONL_BEP_POSN                          equ 0002h
PMCONL_BEP_POSITION                      equ 0002h
PMCONL_BEP_SIZE                          equ 0001h
PMCONL_BEP_LENGTH                        equ 0001h
PMCONL_BEP_MASK                          equ 0004h
PMCONL_CS1P_POSN                         equ 0003h
PMCONL_CS1P_POSITION                     equ 0003h
PMCONL_CS1P_SIZE                         equ 0001h
PMCONL_CS1P_LENGTH                       equ 0001h
PMCONL_CS1P_MASK                         equ 0008h
PMCONL_CS2P_POSN                         equ 0004h
PMCONL_CS2P_POSITION                     equ 0004h
PMCONL_CS2P_SIZE                         equ 0001h
PMCONL_CS2P_LENGTH                       equ 0001h
PMCONL_CS2P_MASK                         equ 0010h
PMCONL_ALP_POSN                          equ 0005h
PMCONL_ALP_POSITION                      equ 0005h
PMCONL_ALP_SIZE                          equ 0001h
PMCONL_ALP_LENGTH                        equ 0001h
PMCONL_ALP_MASK                          equ 0020h
PMCONL_CSF0_POSN                         equ 0006h
PMCONL_CSF0_POSITION                     equ 0006h
PMCONL_CSF0_SIZE                         equ 0001h
PMCONL_CSF0_LENGTH                       equ 0001h
PMCONL_CSF0_MASK                         equ 0040h
PMCONL_CSF1_POSN                         equ 0007h
PMCONL_CSF1_POSITION                     equ 0007h
PMCONL_CSF1_SIZE                         equ 0001h
PMCONL_CSF1_LENGTH                       equ 0001h
PMCONL_CSF1_MASK                         equ 0080h

// Register: PMCONH
#define PMCONH PMCONH
PMCONH                                   equ 0F65h
// bitfield definitions
PMCONH_PTRDEN_POSN                       equ 0000h
PMCONH_PTRDEN_POSITION                   equ 0000h
PMCONH_PTRDEN_SIZE                       equ 0001h
PMCONH_PTRDEN_LENGTH                     equ 0001h
PMCONH_PTRDEN_MASK                       equ 0001h
PMCONH_PTWREN_POSN                       equ 0001h
PMCONH_PTWREN_POSITION                   equ 0001h
PMCONH_PTWREN_SIZE                       equ 0001h
PMCONH_PTWREN_LENGTH                     equ 0001h
PMCONH_PTWREN_MASK                       equ 0002h
PMCONH_PTBEEN_POSN                       equ 0002h
PMCONH_PTBEEN_POSITION                   equ 0002h
PMCONH_PTBEEN_SIZE                       equ 0001h
PMCONH_PTBEEN_LENGTH                     equ 0001h
PMCONH_PTBEEN_MASK                       equ 0004h
PMCONH_ADRMUX0_POSN                      equ 0003h
PMCONH_ADRMUX0_POSITION                  equ 0003h
PMCONH_ADRMUX0_SIZE                      equ 0001h
PMCONH_ADRMUX0_LENGTH                    equ 0001h
PMCONH_ADRMUX0_MASK                      equ 0008h
PMCONH_ADRMUX1_POSN                      equ 0004h
PMCONH_ADRMUX1_POSITION                  equ 0004h
PMCONH_ADRMUX1_SIZE                      equ 0001h
PMCONH_ADRMUX1_LENGTH                    equ 0001h
PMCONH_ADRMUX1_MASK                      equ 0010h
PMCONH_PSIDL_POSN                        equ 0005h
PMCONH_PSIDL_POSITION                    equ 0005h
PMCONH_PSIDL_SIZE                        equ 0001h
PMCONH_PSIDL_LENGTH                      equ 0001h
PMCONH_PSIDL_MASK                        equ 0020h
PMCONH_PMPEN_POSN                        equ 0007h
PMCONH_PMPEN_POSITION                    equ 0007h
PMCONH_PMPEN_SIZE                        equ 0001h
PMCONH_PMPEN_LENGTH                      equ 0001h
PMCONH_PMPEN_MASK                        equ 0080h

// Register: PMDIN1
#define PMDIN1 PMDIN1
PMDIN1                                   equ 0F66h

// Register: PMDIN1L
#define PMDIN1L PMDIN1L
PMDIN1L                                  equ 0F66h

// Register: PMDIN1H
#define PMDIN1H PMDIN1H
PMDIN1H                                  equ 0F67h

// Register: PMADDR
#define PMADDR PMADDR
PMADDR                                   equ 0F68h

// Register: PMADDRL
#define PMADDRL PMADDRL
PMADDRL                                  equ 0F68h

// Register: PMDOUT1L
#define PMDOUT1L PMDOUT1L
PMDOUT1L                                 equ 0F68h

// Register: PMADDRH
#define PMADDRH PMADDRH
PMADDRH                                  equ 0F69h
// bitfield definitions
PMADDRH_ADDRH_POSN                       equ 0000h
PMADDRH_ADDRH_POSITION                   equ 0000h
PMADDRH_ADDRH_SIZE                       equ 0006h
PMADDRH_ADDRH_LENGTH                     equ 0006h
PMADDRH_ADDRH_MASK                       equ 003Fh
PMADDRH_CS1_POSN                         equ 0006h
PMADDRH_CS1_POSITION                     equ 0006h
PMADDRH_CS1_SIZE                         equ 0001h
PMADDRH_CS1_LENGTH                       equ 0001h
PMADDRH_CS1_MASK                         equ 0040h
PMADDRH_CS2_POSN                         equ 0007h
PMADDRH_CS2_POSITION                     equ 0007h
PMADDRH_CS2_SIZE                         equ 0001h
PMADDRH_CS2_LENGTH                       equ 0001h
PMADDRH_CS2_MASK                         equ 0080h

// Register: PMDOUT1H
#define PMDOUT1H PMDOUT1H
PMDOUT1H                                 equ 0F69h

// Register: CMSTAT
#define CMSTAT CMSTAT
CMSTAT                                   equ 0F6Ah
// bitfield definitions
CMSTAT_COUT1_POSN                        equ 0000h
CMSTAT_COUT1_POSITION                    equ 0000h
CMSTAT_COUT1_SIZE                        equ 0001h
CMSTAT_COUT1_LENGTH                      equ 0001h
CMSTAT_COUT1_MASK                        equ 0001h
CMSTAT_COUT2_POSN                        equ 0001h
CMSTAT_COUT2_POSITION                    equ 0001h
CMSTAT_COUT2_SIZE                        equ 0001h
CMSTAT_COUT2_LENGTH                      equ 0001h
CMSTAT_COUT2_MASK                        equ 0002h

// Register: SSP2CON2
#define SSP2CON2 SSP2CON2
SSP2CON2                                 equ 0F6Bh
// bitfield definitions
SSP2CON2_SEN_POSN                        equ 0000h
SSP2CON2_SEN_POSITION                    equ 0000h
SSP2CON2_SEN_SIZE                        equ 0001h
SSP2CON2_SEN_LENGTH                      equ 0001h
SSP2CON2_SEN_MASK                        equ 0001h
SSP2CON2_RSEN_POSN                       equ 0001h
SSP2CON2_RSEN_POSITION                   equ 0001h
SSP2CON2_RSEN_SIZE                       equ 0001h
SSP2CON2_RSEN_LENGTH                     equ 0001h
SSP2CON2_RSEN_MASK                       equ 0002h
SSP2CON2_PEN_POSN                        equ 0002h
SSP2CON2_PEN_POSITION                    equ 0002h
SSP2CON2_PEN_SIZE                        equ 0001h
SSP2CON2_PEN_LENGTH                      equ 0001h
SSP2CON2_PEN_MASK                        equ 0004h
SSP2CON2_RCEN_POSN                       equ 0003h
SSP2CON2_RCEN_POSITION                   equ 0003h
SSP2CON2_RCEN_SIZE                       equ 0001h
SSP2CON2_RCEN_LENGTH                     equ 0001h
SSP2CON2_RCEN_MASK                       equ 0008h
SSP2CON2_ACKEN_POSN                      equ 0004h
SSP2CON2_ACKEN_POSITION                  equ 0004h
SSP2CON2_ACKEN_SIZE                      equ 0001h
SSP2CON2_ACKEN_LENGTH                    equ 0001h
SSP2CON2_ACKEN_MASK                      equ 0010h
SSP2CON2_ACKDT_POSN                      equ 0005h
SSP2CON2_ACKDT_POSITION                  equ 0005h
SSP2CON2_ACKDT_SIZE                      equ 0001h
SSP2CON2_ACKDT_LENGTH                    equ 0001h
SSP2CON2_ACKDT_MASK                      equ 0020h
SSP2CON2_ACKSTAT_POSN                    equ 0006h
SSP2CON2_ACKSTAT_POSITION                equ 0006h
SSP2CON2_ACKSTAT_SIZE                    equ 0001h
SSP2CON2_ACKSTAT_LENGTH                  equ 0001h
SSP2CON2_ACKSTAT_MASK                    equ 0040h
SSP2CON2_GCEN_POSN                       equ 0007h
SSP2CON2_GCEN_POSITION                   equ 0007h
SSP2CON2_GCEN_SIZE                       equ 0001h
SSP2CON2_GCEN_LENGTH                     equ 0001h
SSP2CON2_GCEN_MASK                       equ 0080h
SSP2CON2_ADMSK1_POSN                     equ 0001h
SSP2CON2_ADMSK1_POSITION                 equ 0001h
SSP2CON2_ADMSK1_SIZE                     equ 0001h
SSP2CON2_ADMSK1_LENGTH                   equ 0001h
SSP2CON2_ADMSK1_MASK                     equ 0002h
SSP2CON2_ADMSK2_POSN                     equ 0002h
SSP2CON2_ADMSK2_POSITION                 equ 0002h
SSP2CON2_ADMSK2_SIZE                     equ 0001h
SSP2CON2_ADMSK2_LENGTH                   equ 0001h
SSP2CON2_ADMSK2_MASK                     equ 0004h
SSP2CON2_ADMSK3_POSN                     equ 0003h
SSP2CON2_ADMSK3_POSITION                 equ 0003h
SSP2CON2_ADMSK3_SIZE                     equ 0001h
SSP2CON2_ADMSK3_LENGTH                   equ 0001h
SSP2CON2_ADMSK3_MASK                     equ 0008h
SSP2CON2_ADMSK4_POSN                     equ 0004h
SSP2CON2_ADMSK4_POSITION                 equ 0004h
SSP2CON2_ADMSK4_SIZE                     equ 0001h
SSP2CON2_ADMSK4_LENGTH                   equ 0001h
SSP2CON2_ADMSK4_MASK                     equ 0010h
SSP2CON2_ADMSK5_POSN                     equ 0005h
SSP2CON2_ADMSK5_POSITION                 equ 0005h
SSP2CON2_ADMSK5_SIZE                     equ 0001h
SSP2CON2_ADMSK5_LENGTH                   equ 0001h
SSP2CON2_ADMSK5_MASK                     equ 0020h
SSP2CON2_SEN2_POSN                       equ 0000h
SSP2CON2_SEN2_POSITION                   equ 0000h
SSP2CON2_SEN2_SIZE                       equ 0001h
SSP2CON2_SEN2_LENGTH                     equ 0001h
SSP2CON2_SEN2_MASK                       equ 0001h
SSP2CON2_ADMSK12_POSN                    equ 0001h
SSP2CON2_ADMSK12_POSITION                equ 0001h
SSP2CON2_ADMSK12_SIZE                    equ 0001h
SSP2CON2_ADMSK12_LENGTH                  equ 0001h
SSP2CON2_ADMSK12_MASK                    equ 0002h
SSP2CON2_ADMSK22_POSN                    equ 0002h
SSP2CON2_ADMSK22_POSITION                equ 0002h
SSP2CON2_ADMSK22_SIZE                    equ 0001h
SSP2CON2_ADMSK22_LENGTH                  equ 0001h
SSP2CON2_ADMSK22_MASK                    equ 0004h
SSP2CON2_ADMSK32_POSN                    equ 0003h
SSP2CON2_ADMSK32_POSITION                equ 0003h
SSP2CON2_ADMSK32_SIZE                    equ 0001h
SSP2CON2_ADMSK32_LENGTH                  equ 0001h
SSP2CON2_ADMSK32_MASK                    equ 0008h
SSP2CON2_ACKEN2_POSN                     equ 0004h
SSP2CON2_ACKEN2_POSITION                 equ 0004h
SSP2CON2_ACKEN2_SIZE                     equ 0001h
SSP2CON2_ACKEN2_LENGTH                   equ 0001h
SSP2CON2_ACKEN2_MASK                     equ 0010h
SSP2CON2_ACKDT2_POSN                     equ 0005h
SSP2CON2_ACKDT2_POSITION                 equ 0005h
SSP2CON2_ACKDT2_SIZE                     equ 0001h
SSP2CON2_ACKDT2_LENGTH                   equ 0001h
SSP2CON2_ACKDT2_MASK                     equ 0020h
SSP2CON2_ACKSTAT2_POSN                   equ 0006h
SSP2CON2_ACKSTAT2_POSITION               equ 0006h
SSP2CON2_ACKSTAT2_SIZE                   equ 0001h
SSP2CON2_ACKSTAT2_LENGTH                 equ 0001h
SSP2CON2_ACKSTAT2_MASK                   equ 0040h
SSP2CON2_GCEN2_POSN                      equ 0007h
SSP2CON2_GCEN2_POSITION                  equ 0007h
SSP2CON2_GCEN2_SIZE                      equ 0001h
SSP2CON2_GCEN2_LENGTH                    equ 0001h
SSP2CON2_GCEN2_MASK                      equ 0080h
SSP2CON2_RSEN2_POSN                      equ 0001h
SSP2CON2_RSEN2_POSITION                  equ 0001h
SSP2CON2_RSEN2_SIZE                      equ 0001h
SSP2CON2_RSEN2_LENGTH                    equ 0001h
SSP2CON2_RSEN2_MASK                      equ 0002h
SSP2CON2_PEN2_POSN                       equ 0002h
SSP2CON2_PEN2_POSITION                   equ 0002h
SSP2CON2_PEN2_SIZE                       equ 0001h
SSP2CON2_PEN2_LENGTH                     equ 0001h
SSP2CON2_PEN2_MASK                       equ 0004h
SSP2CON2_RCEN2_POSN                      equ 0003h
SSP2CON2_RCEN2_POSITION                  equ 0003h
SSP2CON2_RCEN2_SIZE                      equ 0001h
SSP2CON2_RCEN2_LENGTH                    equ 0001h
SSP2CON2_RCEN2_MASK                      equ 0008h
SSP2CON2_ADMSK42_POSN                    equ 0004h
SSP2CON2_ADMSK42_POSITION                equ 0004h
SSP2CON2_ADMSK42_SIZE                    equ 0001h
SSP2CON2_ADMSK42_LENGTH                  equ 0001h
SSP2CON2_ADMSK42_MASK                    equ 0010h
SSP2CON2_ADMSK52_POSN                    equ 0005h
SSP2CON2_ADMSK52_POSITION                equ 0005h
SSP2CON2_ADMSK52_SIZE                    equ 0001h
SSP2CON2_ADMSK52_LENGTH                  equ 0001h
SSP2CON2_ADMSK52_MASK                    equ 0020h

// Register: SSP2CON1
#define SSP2CON1 SSP2CON1
SSP2CON1                                 equ 0F6Ch
// bitfield definitions
SSP2CON1_SSPM_POSN                       equ 0000h
SSP2CON1_SSPM_POSITION                   equ 0000h
SSP2CON1_SSPM_SIZE                       equ 0004h
SSP2CON1_SSPM_LENGTH                     equ 0004h
SSP2CON1_SSPM_MASK                       equ 000Fh
SSP2CON1_CKP_POSN                        equ 0004h
SSP2CON1_CKP_POSITION                    equ 0004h
SSP2CON1_CKP_SIZE                        equ 0001h
SSP2CON1_CKP_LENGTH                      equ 0001h
SSP2CON1_CKP_MASK                        equ 0010h
SSP2CON1_SSPEN_POSN                      equ 0005h
SSP2CON1_SSPEN_POSITION                  equ 0005h
SSP2CON1_SSPEN_SIZE                      equ 0001h
SSP2CON1_SSPEN_LENGTH                    equ 0001h
SSP2CON1_SSPEN_MASK                      equ 0020h
SSP2CON1_SSPOV_POSN                      equ 0006h
SSP2CON1_SSPOV_POSITION                  equ 0006h
SSP2CON1_SSPOV_SIZE                      equ 0001h
SSP2CON1_SSPOV_LENGTH                    equ 0001h
SSP2CON1_SSPOV_MASK                      equ 0040h
SSP2CON1_WCOL_POSN                       equ 0007h
SSP2CON1_WCOL_POSITION                   equ 0007h
SSP2CON1_WCOL_SIZE                       equ 0001h
SSP2CON1_WCOL_LENGTH                     equ 0001h
SSP2CON1_WCOL_MASK                       equ 0080h
SSP2CON1_SSPM0_POSN                      equ 0000h
SSP2CON1_SSPM0_POSITION                  equ 0000h
SSP2CON1_SSPM0_SIZE                      equ 0001h
SSP2CON1_SSPM0_LENGTH                    equ 0001h
SSP2CON1_SSPM0_MASK                      equ 0001h
SSP2CON1_SSPM1_POSN                      equ 0001h
SSP2CON1_SSPM1_POSITION                  equ 0001h
SSP2CON1_SSPM1_SIZE                      equ 0001h
SSP2CON1_SSPM1_LENGTH                    equ 0001h
SSP2CON1_SSPM1_MASK                      equ 0002h
SSP2CON1_SSPM2_POSN                      equ 0002h
SSP2CON1_SSPM2_POSITION                  equ 0002h
SSP2CON1_SSPM2_SIZE                      equ 0001h
SSP2CON1_SSPM2_LENGTH                    equ 0001h
SSP2CON1_SSPM2_MASK                      equ 0004h
SSP2CON1_SSPM3_POSN                      equ 0003h
SSP2CON1_SSPM3_POSITION                  equ 0003h
SSP2CON1_SSPM3_SIZE                      equ 0001h
SSP2CON1_SSPM3_LENGTH                    equ 0001h
SSP2CON1_SSPM3_MASK                      equ 0008h
SSP2CON1_SSPM02_POSN                     equ 0000h
SSP2CON1_SSPM02_POSITION                 equ 0000h
SSP2CON1_SSPM02_SIZE                     equ 0001h
SSP2CON1_SSPM02_LENGTH                   equ 0001h
SSP2CON1_SSPM02_MASK                     equ 0001h
SSP2CON1_SSPM12_POSN                     equ 0001h
SSP2CON1_SSPM12_POSITION                 equ 0001h
SSP2CON1_SSPM12_SIZE                     equ 0001h
SSP2CON1_SSPM12_LENGTH                   equ 0001h
SSP2CON1_SSPM12_MASK                     equ 0002h
SSP2CON1_SSPM22_POSN                     equ 0002h
SSP2CON1_SSPM22_POSITION                 equ 0002h
SSP2CON1_SSPM22_SIZE                     equ 0001h
SSP2CON1_SSPM22_LENGTH                   equ 0001h
SSP2CON1_SSPM22_MASK                     equ 0004h
SSP2CON1_SSPM32_POSN                     equ 0003h
SSP2CON1_SSPM32_POSITION                 equ 0003h
SSP2CON1_SSPM32_SIZE                     equ 0001h
SSP2CON1_SSPM32_LENGTH                   equ 0001h
SSP2CON1_SSPM32_MASK                     equ 0008h
SSP2CON1_CKP2_POSN                       equ 0004h
SSP2CON1_CKP2_POSITION                   equ 0004h
SSP2CON1_CKP2_SIZE                       equ 0001h
SSP2CON1_CKP2_LENGTH                     equ 0001h
SSP2CON1_CKP2_MASK                       equ 0010h
SSP2CON1_SSPEN2_POSN                     equ 0005h
SSP2CON1_SSPEN2_POSITION                 equ 0005h
SSP2CON1_SSPEN2_SIZE                     equ 0001h
SSP2CON1_SSPEN2_LENGTH                   equ 0001h
SSP2CON1_SSPEN2_MASK                     equ 0020h
SSP2CON1_SSPOV2_POSN                     equ 0006h
SSP2CON1_SSPOV2_POSITION                 equ 0006h
SSP2CON1_SSPOV2_SIZE                     equ 0001h
SSP2CON1_SSPOV2_LENGTH                   equ 0001h
SSP2CON1_SSPOV2_MASK                     equ 0040h
SSP2CON1_WCOL2_POSN                      equ 0007h
SSP2CON1_WCOL2_POSITION                  equ 0007h
SSP2CON1_WCOL2_SIZE                      equ 0001h
SSP2CON1_WCOL2_LENGTH                    equ 0001h
SSP2CON1_WCOL2_MASK                      equ 0080h

