GopalSaraf/Practicals/PSDL/include/proc/pic18f66j16.inc
// Register: PCL
#define PCL PCL
PCL                                      equ 0FF9h

// Register: PCLATH
#define PCLATH PCLATH
PCLATH                                   equ 0FFAh

// Register: PCLATU
#define PCLATU PCLATU
PCLATU                                   equ 0FFBh

// Register: STKPTR
#define STKPTR STKPTR
STKPTR                                   equ 0FFCh
// bitfield definitions
STKPTR_STKPTR_POSN                       equ 0000h
STKPTR_STKPTR_POSITION                   equ 0000h
STKPTR_STKPTR_SIZE                       equ 0005h
STKPTR_STKPTR_LENGTH                     equ 0005h
STKPTR_STKPTR_MASK                       equ 001Fh
STKPTR_STKUNF_POSN                       equ 0006h
STKPTR_STKUNF_POSITION                   equ 0006h
STKPTR_STKUNF_SIZE                       equ 0001h
STKPTR_STKUNF_LENGTH                     equ 0001h
STKPTR_STKUNF_MASK                       equ 0040h
STKPTR_STKFUL_POSN                       equ 0007h
STKPTR_STKFUL_POSITION                   equ 0007h
STKPTR_STKFUL_SIZE                       equ 0001h
STKPTR_STKFUL_LENGTH                     equ 0001h
STKPTR_STKFUL_MASK                       equ 0080h
STKPTR_STKPTR0_POSN                      equ 0000h
STKPTR_STKPTR0_POSITION                  equ 0000h
STKPTR_STKPTR0_SIZE                      equ 0001h
STKPTR_STKPTR0_LENGTH                    equ 0001h
STKPTR_STKPTR0_MASK                      equ 0001h
STKPTR_STKPTR1_POSN                      equ 0001h
STKPTR_STKPTR1_POSITION                  equ 0001h
STKPTR_STKPTR1_SIZE                      equ 0001h
STKPTR_STKPTR1_LENGTH                    equ 0001h
STKPTR_STKPTR1_MASK                      equ 0002h
STKPTR_STKPTR2_POSN                      equ 0002h
STKPTR_STKPTR2_POSITION                  equ 0002h
STKPTR_STKPTR2_SIZE                      equ 0001h
STKPTR_STKPTR2_LENGTH                    equ 0001h
STKPTR_STKPTR2_MASK                      equ 0004h
STKPTR_STKPTR3_POSN                      equ 0003h
STKPTR_STKPTR3_POSITION                  equ 0003h
STKPTR_STKPTR3_SIZE                      equ 0001h
STKPTR_STKPTR3_LENGTH                    equ 0001h
STKPTR_STKPTR3_MASK                      equ 0008h
STKPTR_STKPTR4_POSN                      equ 0004h
STKPTR_STKPTR4_POSITION                  equ 0004h
STKPTR_STKPTR4_SIZE                      equ 0001h
STKPTR_STKPTR4_LENGTH                    equ 0001h
STKPTR_STKPTR4_MASK                      equ 0010h
STKPTR_STKOVF_POSN                       equ 0007h
STKPTR_STKOVF_POSITION                   equ 0007h
STKPTR_STKOVF_SIZE                       equ 0001h
STKPTR_STKOVF_LENGTH                     equ 0001h
STKPTR_STKOVF_MASK                       equ 0080h
STKPTR_SP0_POSN                          equ 0000h
STKPTR_SP0_POSITION                      equ 0000h
STKPTR_SP0_SIZE                          equ 0001h
STKPTR_SP0_LENGTH                        equ 0001h
STKPTR_SP0_MASK                          equ 0001h
STKPTR_SP1_POSN                          equ 0001h
STKPTR_SP1_POSITION                      equ 0001h
STKPTR_SP1_SIZE                          equ 0001h
STKPTR_SP1_LENGTH                        equ 0001h
STKPTR_SP1_MASK                          equ 0002h
STKPTR_SP2_POSN                          equ 0002h
STKPTR_SP2_POSITION                      equ 0002h
STKPTR_SP2_SIZE                          equ 0001h
STKPTR_SP2_LENGTH                        equ 0001h
STKPTR_SP2_MASK                          equ 0004h
STKPTR_SP3_POSN                          equ 0003h
STKPTR_SP3_POSITION                      equ 0003h
STKPTR_SP3_SIZE                          equ 0001h
STKPTR_SP3_LENGTH                        equ 0001h
STKPTR_SP3_MASK                          equ 0008h
STKPTR_SP4_POSN                          equ 0004h
STKPTR_SP4_POSITION                      equ 0004h
STKPTR_SP4_SIZE                          equ 0001h
STKPTR_SP4_LENGTH                        equ 0001h
STKPTR_SP4_MASK                          equ 0010h

// Register: TOS
#define TOS TOS
TOS                                      equ 0FFDh

// Register: TOSL
#define TOSL TOSL
TOSL                                     equ 0FFDh

// Register: TOSH
#define TOSH TOSH
TOSH                                     equ 0FFEh

// Register: TOSU
#define TOSU TOSU
TOSU                                     equ 0FFFh

/*
 * Bit Access Macros
 */

#ifndef PAGEMASK
#define PAGEMASK(addr) ((addr) and 0FFFFFh)
#endif
#ifndef BANKMASK
#define BANKMASK(addr) ((addr) and 0FFh)
#endif
#define ABDEN                            BANKMASK(BAUDCON1), 0, a
#define ABDEN1                           BANKMASK(BAUDCON1), 0, a
#define ABDEN2                           BANKMASK(BAUDCON2), 0, a
#define ABDOVF                           BANKMASK(BAUDCON1), 7, a
#define ABDOVF1                          BANKMASK(BAUDCON1), 7, a
#define ABDOVF2                          BANKMASK(BAUDCON2), 7, a
#define ACKDT                            BANKMASK(SSP1CON2), 5, a
#define ACKDT1                           BANKMASK(SSP1CON2), 5, a
#define ACKDT2                           BANKMASK(SSP2CON2), 5, a
#define ACKEN                            BANKMASK(SSP1CON2), 4, a
#define ACKEN1                           BANKMASK(SSP1CON2), 4, a
#define ACKEN2                           BANKMASK(SSP2CON2), 4, a
#define ACKSTAT                          BANKMASK(SSP1CON2), 6, a
#define ACKSTAT1                         BANKMASK(SSP1CON2), 6, a
#define ACKSTAT2                         BANKMASK(SSP2CON2), 6, a
#define ACQT0                            BANKMASK(ADCON1), 3, a
#define ACQT1                            BANKMASK(ADCON1), 4, a
#define ACQT2                            BANKMASK(ADCON1), 5, a
#define ADCAL                            BANKMASK(ADCON1), 6, a
#define ADCS0                            BANKMASK(ADCON1), 0, a
#define ADCS1                            BANKMASK(ADCON1), 1, a
#define ADCS2                            BANKMASK(ADCON1), 2, a
#define ADDEN                            BANKMASK(RCSTA1), 3, a
#define ADDEN1                           BANKMASK(RCSTA1), 3, a
#define ADDEN2                           BANKMASK(RCSTA2), 3, a
#define ADFM                             BANKMASK(ADCON1), 7, a
#define ADIE                             BANKMASK(PIE1), 6, a
#define ADIF                             BANKMASK(PIR1), 6, a
#define ADIP                             BANKMASK(IPR1), 6, a
#define ADMSK1                           BANKMASK(SSP1CON2), 1, a
#define ADMSK11                          BANKMASK(SSP1CON2), 1, a
#define ADMSK12                          BANKMASK(SSP2CON2), 1, a
#define ADMSK2                           BANKMASK(SSP1CON2), 2, a
#define ADMSK21                          BANKMASK(SSP1CON2), 2, a
#define ADMSK22                          BANKMASK(SSP2CON2), 2, a
#define ADMSK3                           BANKMASK(SSP1CON2), 3, a
#define ADMSK31                          BANKMASK(SSP1CON2), 3, a
#define ADMSK32                          BANKMASK(SSP2CON2), 3, a
#define ADMSK4                           BANKMASK(SSP1CON2), 4, a
#define ADMSK41                          BANKMASK(SSP1CON2), 4, a
#define ADMSK42                          BANKMASK(SSP2CON2), 4, a
#define ADMSK5                           BANKMASK(SSP1CON2), 5, a
#define ADMSK51                          BANKMASK(SSP1CON2), 5, a
#define ADMSK52                          BANKMASK(SSP2CON2), 5, a
#define ADON                             BANKMASK(ADCON0), 0, a
#define ADRMUX0                          BANKMASK(PMCONH), 3, a
#define ADRMUX1                          BANKMASK(PMCONH), 4, a
#define ADSHR                            BANKMASK(WDTCON), 4, a
#define ALP                              BANKMASK(PMCONL), 5, a
#define AN0                              BANKMASK(PORTA), 0, a
#define AN1                              BANKMASK(PORTA), 1, a
#define AN10                             BANKMASK(PORTF), 5, a
#define AN11                             BANKMASK(PORTF), 6, a
#define AN2                              BANKMASK(PORTA), 2, a
#define AN3                              BANKMASK(PORTA), 3, a
#define AN4                              BANKMASK(PORTA), 5, a
#define AN6                              BANKMASK(PORTF), 1, a
#define AN7                              BANKMASK(PORTF), 2, a
#define AN8                              BANKMASK(PORTF), 3, a
#define AN9                              BANKMASK(PORTF), 4, a
#define BCL1IE                           BANKMASK(PIE2), 3, a
#define BCL1IF                           BANKMASK(PIR2), 3, a
#define BCL1IP                           BANKMASK(IPR2), 3, a
#define BCL2IE                           BANKMASK(PIE3), 6, a
#define BCL2IF                           BANKMASK(PIR3), 6, a
#define BCL2IP                           BANKMASK(IPR3), 6, a
#define BCLIE                            BANKMASK(PIE2), 3, a
#define BCLIF                            BANKMASK(PIR2), 3, a
#define BCLIP                            BANKMASK(IPR2), 3, a
#define BEP                              BANKMASK(PMCONL), 2, a
#define BF                               BANKMASK(SSP1STAT), 0, a
#define BF1                              BANKMASK(SSP1STAT), 0, a
#define BF2                              BANKMASK(SSP2STAT), 0, a
#define BOR                              BANKMASK(RCON), 0, a
#define BRG16                            BANKMASK(BAUDCON1), 3, a
#define BRG161                           BANKMASK(BAUDCON1), 3, a
#define BRG162                           BANKMASK(BAUDCON2), 3, a
#define BRGH                             BANKMASK(TXSTA1), 2, a
#define BRGH1                            BANKMASK(TXSTA1), 2, a
#define BRGH2                            BANKMASK(TXSTA2), 2, a
#define BUSY                             BANKMASK(PMMODEH), 7, a
#define C1INA                            BANKMASK(PORTF), 6, a
#define C1INB                            BANKMASK(PORTF), 5, a
#define C1OUT                            BANKMASK(PORTF), 2, a
#define C1OUTF                           BANKMASK(PORTF), 2, a
#define C2INA                            BANKMASK(PORTF), 4, a
#define C2INB                            BANKMASK(PORTF), 3, a
#define C2OUT                            BANKMASK(PORTF), 1, a
#define C2OUTF                           BANKMASK(PORTF), 1, a
#define C3OUTG                           BANKMASK(PORTG), 1, a
#define CARRY                            BANKMASK(STATUS), 0, a
#define CCH0                             BANKMASK(CM1CON1), 0, a
#define CCH01                            BANKMASK(CM1CON1), 0, a
#define CCH02                            BANKMASK(CM2CON1), 0, a
#define CCH1                             BANKMASK(CM1CON1), 1, a
#define CCH11                            BANKMASK(CM1CON1), 1, a
#define CCH12                            BANKMASK(CM2CON1), 1, a
#define CCP1                             BANKMASK(PORTC), 2, a
#define CCP10                            BANKMASK(PORTE), 2, a
#define CCP1IE                           BANKMASK(PIE1), 2, a
#define CCP1IF                           BANKMASK(PIR1), 2, a
#define CCP1IP                           BANKMASK(IPR1), 2, a
#define CCP1M0                           BANKMASK(ECCP1CON), 0, a
#define CCP1M1                           BANKMASK(ECCP1CON), 1, a
#define CCP1M2                           BANKMASK(ECCP1CON), 2, a
#define CCP1M3                           BANKMASK(ECCP1CON), 3, a
#define CCP1X                            BANKMASK(ECCP1CON), 5, a
#define CCP1Y                            BANKMASK(ECCP1CON), 4, a
#define CCP2E                            BANKMASK(PORTE), 7, a
#define CCP2IE                           BANKMASK(PIE2), 0, a
#define CCP2IF                           BANKMASK(PIR2), 0, a
#define CCP2IP                           BANKMASK(IPR2), 0, a
#define CCP2M0                           BANKMASK(ECCP2CON), 0, a
#define CCP2M1                           BANKMASK(ECCP2CON), 1, a
#define CCP2M2                           BANKMASK(ECCP2CON), 2, a
#define CCP2M3                           BANKMASK(ECCP2CON), 3, a
#define CCP2X                            BANKMASK(ECCP2CON), 5, a
#define CCP2Y                            BANKMASK(ECCP2CON), 4, a
#define CCP2_PA2                         BANKMASK(PORTB), 3, a
#define CCP3                             BANKMASK(PORTG), 0, a
#define CCP3IE                           BANKMASK(PIE3), 0, a
#define CCP3IF                           BANKMASK(PIR3), 0, a
#define CCP3IP                           BANKMASK(IPR3), 0, a
#define CCP3M0                           BANKMASK(ECCP3CON), 0, a
#define CCP3M1                           BANKMASK(ECCP3CON), 1, a
#define CCP3M2                           BANKMASK(ECCP3CON), 2, a
#define CCP3M3                           BANKMASK(ECCP3CON), 3, a
#define CCP3X                            BANKMASK(ECCP3CON), 5, a
#define CCP3Y                            BANKMASK(ECCP3CON), 4, a
#define CCP4                             BANKMASK(PORTG), 3, a
#define CCP4IE                           BANKMASK(PIE3), 1, a
#define CCP4IF                           BANKMASK(PIR3), 1, a
#define CCP4IP                           BANKMASK(IPR3), 1, a
#define CCP4M0                           BANKMASK(CCP4CON), 0, a
#define CCP4M1                           BANKMASK(CCP4CON), 1, a
#define CCP4M2                           BANKMASK(CCP4CON), 2, a
#define CCP4M3                           BANKMASK(CCP4CON), 3, a
#define CCP4OD                           BANKMASK(ODCON1), 3, a
#define CCP5                             BANKMASK(PORTG), 4, a
#define CCP5IE                           BANKMASK(PIE3), 2, a
#define CCP5IF                           BANKMASK(PIR3), 2, a
#define CCP5IP                           BANKMASK(IPR3), 2, a
#define CCP5M0                           BANKMASK(CCP5CON), 0, a
#define CCP5M1                           BANKMASK(CCP5CON), 1, a
#define CCP5M2                           BANKMASK(CCP5CON), 2, a
#define CCP5M3                           BANKMASK(CCP5CON), 3, a
#define CCP5OD                           BANKMASK(ODCON1), 4, a
#define CCP6E                            BANKMASK(PORTE), 6, a
#define CCP7E                            BANKMASK(PORTE), 5, a
#define CCP8E                            BANKMASK(PORTE), 4, a
#define CCP9E                            BANKMASK(PORTE), 3, a
#define CHS0                             BANKMASK(ADCON0), 2, a
#define CHS1                             BANKMASK(ADCON0), 3, a
#define CHS2                             BANKMASK(ADCON0), 4, a
#define CHS3                             BANKMASK(ADCON0), 5, a
#define CHSN3                            BANKMASK(ADCON1), 3, a
#define CK                               BANKMASK(PORTC), 6, a
#define CK2                              BANKMASK(PORTG), 1, a
#define CKE                              BANKMASK(SSP1STAT), 6, a
#define CKE1                             BANKMASK(SSP1STAT), 6, a
#define CKE2                             BANKMASK(SSP2STAT), 6, a
#define CKP                              BANKMASK(SSP1CON1), 4, a
#define CKP1                             BANKMASK(SSP1CON1), 4, a
#define CKP2                             BANKMASK(SSP2CON1), 4, a
#define CKTXP                            BANKMASK(BAUDCON1), 4, a
#define CLKO                             BANKMASK(PORTA), 6, a
#define CM                               BANKMASK(RCON), 5, a
#define CM1IE                            BANKMASK(PIE2), 5, a
#define CM1IF                            BANKMASK(PIR2), 5, a
#define CM1IP                            BANKMASK(IPR2), 5, a
#define CM2IE                            BANKMASK(PIE2), 6, a
#define CM2IF                            BANKMASK(PIR2), 6, a
#define CM2IP                            BANKMASK(IPR2), 6, a
#define CMIE                             BANKMASK(PIE2), 6, a
#define CMIF                             BANKMASK(PIR2), 6, a
#define CMIP                             BANKMASK(IPR2), 6, a
#define COE                              BANKMASK(CM1CON1), 6, a
#define COE1                             BANKMASK(CM1CON1), 6, a
#define COE2                             BANKMASK(CM2CON1), 6, a
#define CON                              BANKMASK(CM1CON1), 7, a
#define CON1                             BANKMASK(CM1CON1), 7, a
#define CON2                             BANKMASK(CM2CON1), 7, a
#define COUT1                            BANKMASK(CMSTAT), 0, a
#define COUT2                            BANKMASK(CMSTAT), 1, a
#define CPOL                             BANKMASK(CM1CON1), 5, a
#define CPOL1                            BANKMASK(CM1CON1), 5, a
#define CPOL2                            BANKMASK(CM2CON1), 5, a
#define CREF                             BANKMASK(CM1CON1), 2, a
#define CREF1                            BANKMASK(CM1CON1), 2, a
#define CREF2                            BANKMASK(CM2CON1), 2, a
#define CREN                             BANKMASK(RCSTA1), 4, a
#define CREN1                            BANKMASK(RCSTA1), 4, a
#define CREN2                            BANKMASK(RCSTA2), 4, a
#define CS                               BANKMASK(PORTE), 2, a
#define CS1                              BANKMASK(PMADDRH), 6, a
#define CS1P                             BANKMASK(PMCONL), 3, a
#define CS2                              BANKMASK(PMADDRH), 7, a
#define CS2P                             BANKMASK(PMCONL), 4, a
#define CSF0                             BANKMASK(PMCONL), 6, a
#define CSF1                             BANKMASK(PMCONL), 7, a
#define CSRC                             BANKMASK(TXSTA1), 7, a
#define CSRC1                            BANKMASK(TXSTA1), 7, a
#define CSRC2                            BANKMASK(TXSTA2), 7, a
#define CVR0                             BANKMASK(CVRCON), 0, a
#define CVR1                             BANKMASK(CVRCON), 1, a
#define CVR2                             BANKMASK(CVRCON), 2, a
#define CVR3                             BANKMASK(CVRCON), 3, a
#define CVREF                            BANKMASK(PORTF), 5, a
#define CVREN                            BANKMASK(CVRCON), 7, a
#define CVROE                            BANKMASK(CVRCON), 6, a
#define CVROEN                           BANKMASK(CVRCON), 6, a
#define CVRR                             BANKMASK(CVRCON), 5, a
#define CVRSS                            BANKMASK(CVRCON), 4, a
#define DA                               BANKMASK(SSP1STAT), 5, a
#define DA1                              BANKMASK(SSP1STAT), 5, a
#define DA2                              BANKMASK(SSP2STAT), 5, a
#define DATA_ADDRESS2                    BANKMASK(SSP2STAT), 5, a
#define DC                               BANKMASK(STATUS), 1, a
#define DC1B0                            BANKMASK(ECCP1CON), 4, a
#define DC1B1                            BANKMASK(ECCP1CON), 5, a
#define DC2B0                            BANKMASK(ECCP2CON), 4, a
#define DC2B1                            BANKMASK(ECCP2CON), 5, a
#define DC3B0                            BANKMASK(ECCP3CON), 4, a
#define DC3B1                            BANKMASK(ECCP3CON), 5, a
#define DC4B0                            BANKMASK(CCP4CON), 4, a
#define DC4B1                            BANKMASK(CCP4CON), 5, a
#define DC5B0                            BANKMASK(CCP5CON), 4, a
#define DC5B1                            BANKMASK(CCP5CON), 5, a
#define DCCP4X                           BANKMASK(CCP4CON), 5, a
#define DCCP4Y                           BANKMASK(CCP4CON), 4, a
#define DCCP5X                           BANKMASK(CCP5CON), 5, a
#define DCCP5Y                           BANKMASK(CCP5CON), 4, a
#define DEVCFG                           BANKMASK(WDTCON), 4, a
#define DONE                             BANKMASK(ADCON0), 1, a
#define DT                               BANKMASK(PORTC), 7, a
#define DT2                              BANKMASK(PORTG), 2, a
#define DTRXP                            BANKMASK(BAUDCON1), 5, a
#define DTRXP1                           BANKMASK(BAUDCON1), 5, a
#define DTRXP2                           BANKMASK(BAUDCON2), 5, a
#define D_A2                             BANKMASK(SSP2STAT), 5, a
#define D_NOT_A2                         BANKMASK(SSP2STAT), 5, a
#define D_nA2                            BANKMASK(SSP2STAT), 5, a
#define EBDIS                            BANKMASK(PR2), 7, a
#define ECCP1AS0                         BANKMASK(ECCP1AS), 4, a
#define ECCP1AS1                         BANKMASK(ECCP1AS), 5, a
#define ECCP1AS2                         BANKMASK(ECCP1AS), 6, a
#define ECCP1ASE                         BANKMASK(ECCP1AS), 7, a
#define ECCP1OD                          BANKMASK(ODCON1), 0, a
#define ECCP2AS0                         BANKMASK(ECCP2AS), 4, a
#define ECCP2AS1                         BANKMASK(ECCP2AS), 5, a
#define ECCP2AS2                         BANKMASK(ECCP2AS), 6, a
#define ECCP2ASE                         BANKMASK(ECCP2AS), 7, a
#define ECCP2OD                          BANKMASK(ODCON1), 1, a
#define ECCP3AS0                         BANKMASK(ECCP3AS), 4, a
#define ECCP3AS1                         BANKMASK(ECCP3AS), 5, a
#define ECCP3AS2                         BANKMASK(ECCP3AS), 6, a
#define ECCP3ASE                         BANKMASK(ECCP3AS), 7, a
#define ECCP3OD                          BANKMASK(ODCON1), 2, a
#define EVPOL0                           BANKMASK(CM1CON1), 3, a
#define EVPOL01                          BANKMASK(CM1CON1), 3, a
#define EVPOL02                          BANKMASK(CM2CON1), 3, a
#define EVPOL1                           BANKMASK(CM1CON1), 4, a
#define EVPOL11                          BANKMASK(CM1CON1), 4, a
#define EVPOL12                          BANKMASK(CM2CON1), 4, a
#define FERR                             BANKMASK(RCSTA1), 2, a
#define FERR1                            BANKMASK(RCSTA1), 2, a
#define FERR2                            BANKMASK(RCSTA2), 2, a
#define FLT0                             BANKMASK(PORTB), 0, a
#define FREE                             BANKMASK(EECON1), 4, a
#define GCEN                             BANKMASK(SSP1CON2), 7, a
#define GCEN1                            BANKMASK(SSP1CON2), 7, a
#define GCEN2                            BANKMASK(SSP2CON2), 7, a
#define GIE                              BANKMASK(INTCON), 7, a
#define GIEH                             BANKMASK(INTCON), 7, a
#define GIEL                             BANKMASK(INTCON), 6, a
#define GIE_GIEH                         BANKMASK(INTCON), 7, a
#define GO                               BANKMASK(ADCON0), 1, a
#define GODONE                           BANKMASK(ADCON0), 1, a
#define GO_DONE                          BANKMASK(ADCON0), 1, a
#define GO_NOT_DONE                      BANKMASK(ADCON0), 1, a
#define GO_nDONE                         BANKMASK(ADCON0), 1, a
#define I2C_DAT2                         BANKMASK(SSP2STAT), 5, a
#define I2C_READ2                        BANKMASK(SSP2STAT), 2, a
#define I2C_START2                       BANKMASK(SSP2STAT), 3, a
#define I2C_STOP2                        BANKMASK(SSP2STAT), 4, a
#define IB0F                             BANKMASK(PMSTATH), 0, b
#define IB1F                             BANKMASK(PMSTATH), 1, b
#define IB2F                             BANKMASK(PMSTATH), 2, b
#define IB3F                             BANKMASK(PMSTATH), 3, b
#define IBF                              BANKMASK(PMSTATH), 7, b
#define IBOV                             BANKMASK(PMSTATH), 6, b
#define IDLEN                            BANKMASK(OSCCON), 7, a
#define INCM0                            BANKMASK(PMMODEH), 3, a
#define INCM1                            BANKMASK(PMMODEH), 4, a
#define INT0                             BANKMASK(PORTB), 0, a
#define INT0E                            BANKMASK(INTCON), 4, a
#define INT0F                            BANKMASK(INTCON), 1, a
#define INT0IE                           BANKMASK(INTCON), 4, a
#define INT0IF                           BANKMASK(INTCON), 1, a
#define INT1                             BANKMASK(PORTB), 1, a
#define INT1E                            BANKMASK(INTCON3), 3, a
#define INT1F                            BANKMASK(INTCON3), 0, a
#define INT1IE                           BANKMASK(INTCON3), 3, a
